posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.org
#+BEGIN_COMMENT
.. title: 博客迁移杂记-从 Hexo 到 Nikola
.. slug: bo-ke-qian-yi-za-ji-cong-hexodao-nikola
.. date: 2018-01-07 21:12:15 UTC+08:00
.. tags: Blog, Nikola, Org-mode
.. category: EMACS
.. link: 
.. description: 
.. type: text
#+END_COMMENT


* 迁移原因
16 年年初，开始搭建自己的个人博客，一不小心入了 =spacemacs= 的坑，一直用 =Org-mode= 写作、记笔记等，因此博客必须支持 =Org-mode= ，最开始的解决方案是 Hexo，用 [[hexo-renderer-org]] 将 Org-mde 格式转化，使用 Next 主题，确实比较好看，当时配置博客站点花了很长时间，在使用过程中，总是会有 hexo 插件更新问题，导致博客不能发布等，因此，最近一个月寻找 hexo 的替代者。

Nikola 是用 Python 写的，恰好以后要学 Python，同时 Nikola 通过 Org-mode 插件支持 Org-mode，于是选择 Nikola 作为博客框架，目前一切还好，就是主题比较难看。博客迁移过程用，参考[fn:1][fn:2][fn:3][fn:4] 

{{{TEASER_END}}}

* Nikola 安装和配置

** 安装

#+BEGIN_SRC sh
  sudo pip install Nikola[extras]

  git clone git@github.com:<username>.github.io.git ~/Nikola

  cd ~/Nikola

  git checkout -b blog

#+END_SRC

编辑 .gitignore 文件，加入内容

#+BEGIN_SRC sh
  ,*.py[cod]
  __pycache__
  cache
  output
  .doit.db
  _env/
#+END_SRC


#+BEGIN_SRC sh
  git add .gitignore
  git commit -m "Add .gitignore"
#+END_SRC

建站 blog

#+BEGIN_SRC sh
  $ nikola init my_first_site
  # Fill the asked information
  # 把子文件信息弄到根目录来
  $ mv my_first_site/* .
  $ rm -r my_first_site
#+END_SRC


#+BEGIN_SRC sh
  git add conf.py
  git commit -m "Add conf.py"
#+END_SRC


#+BEGIN_SRC sh
  nikola new_post -e
  nikola build
  nikola serve --browser
#+END_SRC

此时应该可以在浏览器中看到网站的初始样子了

** 配置

配置文件是主目录下 .conf.py 文件

*** 修改自定义位置

下面是我的自定义，可以参照修改

#+BEGIN_SRC sh
  # Data about this site
  BLOG_AUTHOR = "Lengyueyang"  # (translatable)
  BLOG_TITLE = "深度识医"  # (translatable)
  # This is the main URL for your site. It will be used
  # in a prominent link. Don't forget the protocol (http/https)!
  SITE_URL = "https://lengyueyang.github.io/"
  # This is the URL where Nikola's output will be deployed.
  # If not set, defaults to SITE_URL
  # BASE_URL = "https://example.com/"
  BLOG_EMAIL = "maoxiaowei1988@qq.com"
  BLOG_DESCRIPTION = "Lengyueyang's personal blog."  # (translatable)

  NAVIGATION_LINKS = {
      DEFAULT_LANG: (
          ("/archive.html", "Archives"),
          ("/categories/index.html", "Tags"),
          ("/pages/notes.html", "Notes"),
          ("/pages/about.html", "About"),
          ("https://github.com/lengyueyang", "Github"),
          ("/pages/links.html", "Links"),
          ("/rss.xml", "RSS feed"),
      ),
  }

#+END_SRC

