posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>博客迁移杂记-从 Hexo 到 Nikola | 深度识医</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://lengyueyang.github.io/posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Lengyueyang">
<link rel="prev" href="test.html" title="Test" type="text/html">
<meta property="og:site_name" content="深度识医">
<meta property="og:title" content="博客迁移杂记-从 Hexo 到 Nikola">
<meta property="og:url" content="https://lengyueyang.github.io/posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html">
<meta property="og:description" content="Table of Contents


迁移原因
Nikola 安装和配置

安装
配置

修改自定义位置
Archive 按照时间排序，去掉年份，首页显示缩略版
增加 google 搜索
增加评论
主题
语法高亮




Org-mode 配置

Org-mode 和 tags 支持
Math 支持

Mathjax
Latex preview




Emacs 管理 blog
TODO 后期">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-01-07T21:12:15+08:00">
<meta property="article:tag" content="Blog">
<meta property="article:tag" content="Nikola">
<meta property="article:tag" content="Org-mode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://lengyueyang.github.io/">

                <span id="blog-title">深度识医</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archives</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../pages/notes.html">Notes</a>
                </li>
<li>
<a href="../pages/about.html">About</a>
                </li>
<li>
<a href="https://github.com/lengyueyang">Github</a>
                </li>
<li>
<a href="../pages/links.html">Links</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<!-- Google custom search --><form method="get" action="https://www.google.com/search" class="navbar-form navbar-right" role="search">
<div class="form-group">
<input type="text" name="q" class="form-control" placeholder="Search">
</div>
<button type="submit" class="btn btn-primary">
	<span class="glyphicon glyphicon-search"></span>
</button>
<input type="hidden" name="sitesearch" value="https://lengyueyang.github.io/">
</form>
<!-- End of custom search -->


            <ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">博客迁移杂记-从 Hexo 到 Nikola</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Lengyueyang
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2018-01-07T21:12:15+08:00" itemprop="datePublished" title="2018-01-07 21:12">2018-01-07 21:12</time></a></p>
                <p class="commentline">
        
    <a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#disqus_thread" data-disqus-identifier="cache/posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html">Comments</a>


            

        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-1">迁移原因</a></li>
<li>
<a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2">Nikola 安装和配置</a>
<ul>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-1">安装</a></li>
<li>
<a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2">配置</a>
<ul>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-1">修改自定义位置</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-2">Archive 按照时间排序，去掉年份，首页显示缩略版</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-3">增加 google 搜索</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-4">增加评论</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-5">主题</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-2-2-6">语法高亮</a></li>
</ul>
</li>
</ul>
</li>
<li>
<a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-3">Org-mode 配置</a>
<ul>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-3-1">Org-mode 和 tags 支持</a></li>
<li>
<a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-3-2">Math 支持</a>
<ul>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-3-2-1">Mathjax</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-3-2-2">Latex preview</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-4">Emacs 管理 blog</a></li>
<li><a href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#sec-5"><span class="todo TODO">TODO</span> 后期实现</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">迁移原因</h2>
<div class="outline-text-2" id="text-1">
<p>
16 年年初，开始搭建自己的个人博客，一不小心入了 <code>spacemacs</code> 的坑，一直用 <code>Org-mode</code> 写作、记笔记等，因此博客必须支持 <code>Org-mode</code> ，最开始的解决方案是 Hexo，用 <i>hexo-renderer-org</i> 将 Org-mde 格式转化，使用 Next 主题，确实比较好看，当时配置博客站点花了很长时间，在使用过程中，总是会有 hexo 插件更新问题，导致博客不能发布等，因此，最近一个月寻找 hexo 的替代者。
</p>

<p>
Nikola 是用 Python 写的，恰好以后要学 Python，同时 Nikola 通过 Org-mode 插件支持 Org-mode，于是选择 Nikola 作为博客框架，目前一切还好，就是主题比较难看。博客迁移过程用，参考<sup><a id="fnr.1" name="fnr.1" class="footref" href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2" name="fnr.2" class="footref" href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#fn.2">2</a></sup><sup>, </sup><sup><a id="fnr.3" name="fnr.3" class="footref" href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#fn.3">3</a></sup><sup>, </sup><sup><a id="fnr.4" name="fnr.4" class="footref" href="bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html#fn.4">4</a></sup></p>

<!-- TEASER_END -->
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Nikola 安装和配置</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">安装</h3>
<div class="outline-text-3" id="text-2-1">
<div class="highlight"><pre><span></span>sudo pip install Nikola<span class="o">[</span>extras<span class="o">]</span>

git clone git@github.com:&lt;username&gt;.github.io.git ~/Nikola

<span class="nb">cd</span> ~/Nikola

git checkout -b blog
</pre></div>

<p>
编辑 .gitignore 文件，加入内容
</p>

<div class="highlight"><pre><span></span>*.py<span class="o">[</span>cod<span class="o">]</span>
__pycache__
cache
output
.doit.db
_env/
</pre></div>


<div class="highlight"><pre><span></span>git add .gitignore
git commit -m <span class="s2">"Add .gitignore"</span>
</pre></div>

<p>
建站 blog
</p>

<div class="highlight"><pre><span></span>$ nikola init my_first_site
<span class="c1"># Fill the asked information</span>
<span class="c1"># 把子文件信息弄到根目录来</span>
$ mv my_first_site/* .
$ rm -r my_first_site
</pre></div>


<div class="highlight"><pre><span></span>git add conf.py
git commit -m <span class="s2">"Add conf.py"</span>
</pre></div>


<div class="highlight"><pre><span></span>nikola new_post -e
nikola build
nikola serve --browser
</pre></div>

<p>
此时应该可以在浏览器中看到网站的初始样子了
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">配置</h3>
<div class="outline-text-3" id="text-2-2">
<p>
配置文件是主目录下 .conf.py 文件
</p>
</div>


<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">修改自定义位置</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
下面是我的自定义，可以参照修改
</p>

<div class="highlight"><pre><span></span><span class="c1"># Data about this site</span>
<span class="nv">BLOG_AUTHOR</span> <span class="o">=</span> <span class="s2">"Lengyueyang"</span>  <span class="c1"># (translatable)</span>
<span class="nv">BLOG_TITLE</span> <span class="o">=</span> <span class="s2">"深度识医"</span>  <span class="c1"># (translatable)</span>
<span class="c1"># This is the main URL for your site. It will be used</span>
<span class="c1"># in a prominent link. Don't forget the protocol (http/https)!</span>
<span class="nv">SITE_URL</span> <span class="o">=</span> <span class="s2">"https://lengyueyang.github.io/"</span>
<span class="c1"># This is the URL where Nikola's output will be deployed.</span>
<span class="c1"># If not set, defaults to SITE_URL</span>
<span class="c1"># BASE_URL = "https://example.com/"</span>
<span class="nv">BLOG_EMAIL</span> <span class="o">=</span> <span class="s2">"maoxiaowei1988@qq.com"</span>
<span class="nv">BLOG_DESCRIPTION</span> <span class="o">=</span> <span class="s2">"Lengyueyang's personal blog."</span>  <span class="c1"># (translatable)</span>

<span class="nv">NAVIGATION_LINKS</span> <span class="o">=</span> <span class="o">{</span>
    DEFAULT_LANG: <span class="o">(</span>
	<span class="o">(</span><span class="s2">"/archive.html"</span>, <span class="s2">"Archives"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"/categories/index.html"</span>, <span class="s2">"Tags"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"/pages/notes.html"</span>, <span class="s2">"Notes"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"/pages/about.html"</span>, <span class="s2">"About"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"https://github.com/lengyueyang"</span>, <span class="s2">"Github"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"/pages/links.html"</span>, <span class="s2">"Links"</span><span class="o">)</span>,
	<span class="o">(</span><span class="s2">"/rss.xml"</span>, <span class="s2">"RSS feed"</span><span class="o">)</span>,
    <span class="o">)</span>,
<span class="o">}</span>
</pre></div>
</div>
</div>
