posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.org
*** Archive 按照时间排序，去掉年份，首页显示缩略版

#+BEGIN_SRC sh

  I# Create per-month archives instead of per-year
  # CREATE_MONTHLY_ARCHIVE = False
  # Create one large archive instead of per-year
  # CREATE_SINGLE_ARCHIVE = False
  CREATE_SINGLE_ARCHIVE = True
  # Create year, month, and day archives each with a (long) list of posts
  # (overrides both CREATE_MONTHLY_ARCHIVE and CREATE_SINGLE_ARCHIVE)
  # CREATE_FULL_ARCHIVES = False
  # If monthly archives or full archives are created, adds also one archive per day
  # CREATE_DAILY_ARCHIVE = False
  # Create previous, up, next navigation links for archives
  # CREATE_ARCHIVE_NAVIGATION = False
  # Final locations for the archives are:
  # output / TRANSLATION[lang] / ARCHIVE_PATH / ARCHIVE_FILENAME
  # output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / index.html
  # output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / MONTH / index.html
  # output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / MONTH / DAY / index.html
  # ARCHIVE_PATH = ""
  # ARCHIVE_FILENAME = "archive.html"

  NDEX_TEASERS = True

  # github_deploy configuration
  # For more details, read the manual:
  # https://getnikola.com/handbook.html#deploying-to-github
  # You will need to configure the deployment branch on GitHub.
  GITHUB_SOURCE_BRANCH = 'blog'
  GITHUB_DEPLOY_BRANCH = 'master'

#+END_SRC

*** 增加 google 搜索

#+BEGIN_SRC sh
  # If you prefer a Google search form, here's an example that should just work:
  SEARCH_FORM = """
  <!-- Google custom search -->
  <form method="get" action="https://www.google.com/search" class="navbar-form navbar-right" role="search">
  <div class="form-group">
  <input type="text" name="q" class="form-control" placeholder="Search">
  </div>
  <button type="submit" class="btn btn-primary">
    <span class="glyphicon glyphicon-search"></span>
  </button>
  <input type="hidden" name="sitesearch" value="%s">
  </form>
  <!-- End of custom search -->
  """ % SITE_URL

#+END_SRC

*** 增加评论

#+BEGIN_SRC sh
  COMMENT_SYSTEM = "disqus"
  # And you also need to add your COMMENT_SYSTEM_ID which
  # depends on what comment system you use. The default is
  # "nikolademo" which is a test account for Disqus. More information
  # is in the manual.
  COMMENT_SYSTEM_ID = "your-ID"

#+END_SRC

*** 主题

#+BEGIN_SRC sh
  nikola install_theme bootstrap3

  nikola bootswatch_theme -n custom_theme -s darkly -p bootstrap3 
#+END_SRC

可以在 https://bootswatch.com/3/ 查找合适的主题，下载

*** 语法高亮

#+BEGIN_SRC sh
  mkdir -p files/assets/css/
  pygmentize -S friendly -a .highlight -f html >> files/assets/css/custom.css
#+END_SRC

默认使用 pygments，可以在 init.el 或 conf.el 中把 nikola-use-pygments 改成 nil 来取消它。

为了正常显示语法高亮，需要增加相应的 custom.css，并确保 custom.css 被 theme 使用了用 pygmentize 生成相应的 css 文件， <PYGMENTSSTYLE> 可以用 pygmentize -L style 查看，比如 colorful,friendly 

*** 发布时，复制特定文件夹到 output


#+BEGIN_SRC sh

  FILES_FOLDERS = {'posts/ltxpng': 'posts/ltxpng', 'posts/MSimg': 'posts/MSimg', 'posts/file':'posts/file'}

#+END_SRC

运行 =nikola build= , 可以复制 posts 下的三个文件夹到 output/posts 下面

* Org-mode 配置

** Org-mode 和 tags 支持

#+BEGIN_SRC sh
  nikola plugin -i orgmode
  nikola plugin -i tags
#+END_SRC

在 post 和 pages 等加入 org-mode 支持


#+BEGIN_SRC sh
  POSTS = (
      ("posts/*.org", "posts", "post.tmpl"),
      ("posts/*.rst", "posts", "post.tmpl"),
      ("posts/*.md", "posts", "post.tmpl"),
      ("posts/*.txt", "posts", "post.tmpl"),
      ("posts/*.html", "posts", "post.tmpl"),
  )
  PAGES = (
      ("pages/*.org", "pages", "page.tmpl"),
      ("pages/*.rst", "pages", "page.tmpl"),
      ("pages/*.md", "pages", "page.tmpl"),
      ("pages/*.txt", "pages", "page.tmpl"),
      ("pages/*.html", "pages", "page.tmpl"),
  )

  COMPILERS = {
      "rest": ('.rst', '.txt'),
      "markdown": ('.md', '.mdown', '.markdown'),
      "textile": ('.textile',),
      "txt2tags": ('.t2t',),
      "bbcode": ('.bb',),
      "wiki": ('.wiki',),
      "ipynb": ('.ipynb',),
      "html": ('.html', '.htm'),
      "orgmode": ('.org',),
      # PHP files are rendered the usual way (i.e. with the full templates).
      # The resulting files have .php extensions, making it possible to run
      # them without reconfiguring your server to recognize them.
      "php": ('.php',),
      # Pandoc detects the input from the source filename
      # but is disabled by default as it would conflict
      # with many of the others.
      # "pandoc": ('.rst', '.md', '.txt'),
  }

#+END_SRC

** Math 支持
我的博客中，有个别文章有特别多的数学公式，其中有很多自定义，这里有两种方法

*** Mathjax
用 mathjax，通过在 metedata tags 加入 mathjax，但是 一些自定义的定理环境不能显示

