posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">Archive 按照时间排序，去掉年份，首页显示缩略版</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="highlight"><pre><span></span>I# Create per-month archives instead of per-year
<span class="c1"># CREATE_MONTHLY_ARCHIVE = False</span>
<span class="c1"># Create one large archive instead of per-year</span>
<span class="c1"># CREATE_SINGLE_ARCHIVE = False</span>
<span class="nv">CREATE_SINGLE_ARCHIVE</span> <span class="o">=</span> True
<span class="c1"># Create year, month, and day archives each with a (long) list of posts</span>
<span class="c1"># (overrides both CREATE_MONTHLY_ARCHIVE and CREATE_SINGLE_ARCHIVE)</span>
<span class="c1"># CREATE_FULL_ARCHIVES = False</span>
<span class="c1"># If monthly archives or full archives are created, adds also one archive per day</span>
<span class="c1"># CREATE_DAILY_ARCHIVE = False</span>
<span class="c1"># Create previous, up, next navigation links for archives</span>
<span class="c1"># CREATE_ARCHIVE_NAVIGATION = False</span>
<span class="c1"># Final locations for the archives are:</span>
<span class="c1"># output / TRANSLATION[lang] / ARCHIVE_PATH / ARCHIVE_FILENAME</span>
<span class="c1"># output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / index.html</span>
<span class="c1"># output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / MONTH / index.html</span>
<span class="c1"># output / TRANSLATION[lang] / ARCHIVE_PATH / YEAR / MONTH / DAY / index.html</span>
<span class="c1"># ARCHIVE_PATH = ""</span>
<span class="c1"># ARCHIVE_FILENAME = "archive.html"</span>

<span class="nv">NDEX_TEASERS</span> <span class="o">=</span> True

<span class="c1"># github_deploy configuration</span>
<span class="c1"># For more details, read the manual:</span>
<span class="c1"># https://getnikola.com/handbook.html#deploying-to-github</span>
<span class="c1"># You will need to configure the deployment branch on GitHub.</span>
<span class="nv">GITHUB_SOURCE_BRANCH</span> <span class="o">=</span> <span class="s1">'blog'</span>
<span class="nv">GITHUB_DEPLOY_BRANCH</span> <span class="o">=</span> <span class="s1">'master'</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">增加 google 搜索</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="highlight"><pre><span></span><span class="c1"># If you prefer a Google search form, here's an example that should just work:</span>
<span class="nv">SEARCH_FORM</span> <span class="o">=</span> <span class="s2">"""</span>
<span class="s2">&lt;!-- Google custom search --&gt;</span>
<span class="s2">&lt;form method="</span>get<span class="s2">" action="</span>https://www.google.com/search<span class="s2">" class="</span>navbar-form navbar-right<span class="s2">" role="</span>search<span class="s2">"&gt;</span>
<span class="s2">&lt;div class="</span>form-group<span class="s2">"&gt;</span>
<span class="s2">&lt;input type="</span>text<span class="s2">" name="</span>q<span class="s2">" class="</span>form-control<span class="s2">" placeholder="</span>Search<span class="s2">"&gt;</span>
<span class="s2">&lt;/div&gt;</span>
<span class="s2">&lt;button type="</span>submit<span class="s2">" class="</span>btn btn-primary<span class="s2">"&gt;</span>
<span class="s2">  &lt;span class="</span>glyphicon glyphicon-search<span class="s2">"&gt;&lt;/span&gt;</span>
<span class="s2">&lt;/button&gt;</span>
<span class="s2">&lt;input type="</span>hidden<span class="s2">" name="</span>sitesearch<span class="s2">" value="</span>%s<span class="s2">"&gt;</span>
<span class="s2">&lt;/form&gt;</span>
<span class="s2">&lt;!-- End of custom search --&gt;</span>
<span class="s2">"""</span> % SITE_URL
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">增加评论</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="highlight"><pre><span></span><span class="nv">COMMENT_SYSTEM</span> <span class="o">=</span> <span class="s2">"disqus"</span>
<span class="c1"># And you also need to add your COMMENT_SYSTEM_ID which</span>
<span class="c1"># depends on what comment system you use. The default is</span>
<span class="c1"># "nikolademo" which is a test account for Disqus. More information</span>
<span class="c1"># is in the manual.</span>
<span class="nv">COMMENT_SYSTEM_ID</span> <span class="o">=</span> <span class="s2">"your-ID"</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">主题</h4>
<div class="outline-text-4" id="text-2-2-5">
<div class="highlight"><pre><span></span>nikola install_theme bootstrap3

nikola bootswatch_theme -n custom_theme -s darkly -p bootstrap3 
</pre></div>

<p>
可以在 <a href="https://bootswatch.com/3/">https://bootswatch.com/3/</a> 查找合适的主题，下载
</p>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">语法高亮</h4>
<div class="outline-text-4" id="text-2-2-6">
<div class="highlight"><pre><span></span>mkdir -p files/assets/css/
pygmentize -S friendly -a .highlight -f html &gt;&gt; files/assets/css/custom.css
</pre></div>

<p>
默认使用 pygments，可以在 init.el 或 conf.el 中把 nikola-use-pygments 改成 nil 来取消它。
</p>

<p>
为了正常显示语法高亮，需要增加相应的 custom.css，并确保 custom.css 被 theme 使用了用 pygmentize 生成相应的 css 文件， &lt;PYGMENTSSTYLE&gt; 可以用 pygmentize -L style 查看，比如 colorful,friendly 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Org-mode 配置</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Org-mode 和 tags 支持</h3>
<div class="outline-text-3" id="text-3-1">
<div class="highlight"><pre><span></span>nikola plugin -i orgmode
nikola plugin -i tags
</pre></div>

<p>
在 post 和 pages 等加入 org-mode 支持
</p>


<div class="highlight"><pre><span></span><span class="nv">POSTS</span> <span class="o">=</span> <span class="o">(</span>
    <span class="o">(</span><span class="s2">"posts/*.org"</span>, <span class="s2">"posts"</span>, <span class="s2">"post.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"posts/*.rst"</span>, <span class="s2">"posts"</span>, <span class="s2">"post.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"posts/*.md"</span>, <span class="s2">"posts"</span>, <span class="s2">"post.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"posts/*.txt"</span>, <span class="s2">"posts"</span>, <span class="s2">"post.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"posts/*.html"</span>, <span class="s2">"posts"</span>, <span class="s2">"post.tmpl"</span><span class="o">)</span>,
<span class="o">)</span>
<span class="nv">PAGES</span> <span class="o">=</span> <span class="o">(</span>
    <span class="o">(</span><span class="s2">"pages/*.org"</span>, <span class="s2">"pages"</span>, <span class="s2">"page.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"pages/*.rst"</span>, <span class="s2">"pages"</span>, <span class="s2">"page.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"pages/*.md"</span>, <span class="s2">"pages"</span>, <span class="s2">"page.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"pages/*.txt"</span>, <span class="s2">"pages"</span>, <span class="s2">"page.tmpl"</span><span class="o">)</span>,
    <span class="o">(</span><span class="s2">"pages/*.html"</span>, <span class="s2">"pages"</span>, <span class="s2">"page.tmpl"</span><span class="o">)</span>,
<span class="o">)</span>

<span class="nv">COMPILERS</span> <span class="o">=</span> <span class="o">{</span>
    <span class="s2">"rest"</span>: <span class="o">(</span><span class="s1">'.rst'</span>, <span class="s1">'.txt'</span><span class="o">)</span>,
    <span class="s2">"markdown"</span>: <span class="o">(</span><span class="s1">'.md'</span>, <span class="s1">'.mdown'</span>, <span class="s1">'.markdown'</span><span class="o">)</span>,
    <span class="s2">"textile"</span>: <span class="o">(</span><span class="s1">'.textile'</span>,<span class="o">)</span>,
    <span class="s2">"txt2tags"</span>: <span class="o">(</span><span class="s1">'.t2t'</span>,<span class="o">)</span>,
    <span class="s2">"bbcode"</span>: <span class="o">(</span><span class="s1">'.bb'</span>,<span class="o">)</span>,
    <span class="s2">"wiki"</span>: <span class="o">(</span><span class="s1">'.wiki'</span>,<span class="o">)</span>,
    <span class="s2">"ipynb"</span>: <span class="o">(</span><span class="s1">'.ipynb'</span>,<span class="o">)</span>,
    <span class="s2">"html"</span>: <span class="o">(</span><span class="s1">'.html'</span>, <span class="s1">'.htm'</span><span class="o">)</span>,
    <span class="s2">"orgmode"</span>: <span class="o">(</span><span class="s1">'.org'</span>,<span class="o">)</span>,
    <span class="c1"># PHP files are rendered the usual way (i.e. with the full templates).</span>
    <span class="c1"># The resulting files have .php extensions, making it possible to run</span>
    <span class="c1"># them without reconfiguring your server to recognize them.</span>
    <span class="s2">"php"</span>: <span class="o">(</span><span class="s1">'.php'</span>,<span class="o">)</span>,
    <span class="c1"># Pandoc detects the input from the source filename</span>
    <span class="c1"># but is disabled by default as it would conflict</span>
    <span class="c1"># with many of the others.</span>
    <span class="c1"># "pandoc": ('.rst', '.md', '.txt'),</span>
<span class="o">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Math 支持</h3>
<div class="outline-text-3" id="text-3-2">
<p>
我的博客中，有个别文章有特别多的数学公式，其中有很多自定义，这里有两种方法
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Mathjax</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
用 mathjax，通过在 metedata tags 加入 mathjax，但是 一些自定义的定理环境不能显示
</p>
</div>
</div>
