posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.org
*** Latex preview
通过 Org-mode 的 latex preview 功能，在到处 html 时，将数学公式变成图片，可以通过以下配置
在 plugins org-mode 文件夹中建立 conf.el 文件，加入以下配置

#+BEGIN_SRC sh
  ;; Init file to use with the orgmode plugin.

  ;; Load org-mode
  ;; Requires org-mode v8.x


  ;;; Custom configuration for the export.

  ;;; Add any custom configuration that you would like to 'conf.el'.
  (setq nikola-use-pygments t
        org-export-with-toc t
        org-export-with-section-numbers nil
        org-startup-folded 'showeverything)


  ;;org-mode export to latex
  (require 'ox-latex)
  (setq org-export-latex-listings t)

  ;;org-mode source code setup in exporting to latex
  (add-to-list 'org-latex-listings
               '("" "listings"))
  (add-to-list 'org-latex-listings
               '("" "color"))
  (add-to-list 'org-latex-packages-alist
               '("" "xcolor" t))
  (add-to-list 'org-latex-packages-alist
               '("" "listings" t))
  ;;(add-to-list 'org-latex-packages-alist
  ;;             '("" "fontspec" t))
  (add-to-list 'org-latex-packages-alist
               '("" "indentfirst" t))
  ;;(add-to-list 'org-latex-packages-alist
  ;;             '("" "xunicode" t))
  (add-to-list 'org-latex-packages-alist
               '("" "geometry"))
  (add-to-list 'org-latex-packages-alist
               '("" "float"))
  (add-to-list 'org-latex-packages-alist
               '("" "longtable"))
  (add-to-list 'org-latex-packages-alist
               '("" "tikz"))
  (add-to-list 'org-latex-packages-alist
               '("" "fancyhdr"))
  (add-to-list 'org-latex-packages-alist
               '("" "textcomp"))
  (add-to-list 'org-latex-packages-alist
               '("" "amsmath"))
  (add-to-list 'org-latex-packages-alist
               '("" "amsthm"))
  (add-to-list 'org-latex-packages-alist
               '("" "tabularx" t))
  (add-to-list 'org-latex-packages-alist
               '("" "booktabs" t))
  (add-to-list 'org-latex-packages-alist
               '("" "grffile" t))
  (add-to-list 'org-latex-packages-alist
               '("" "wrapfig" t))
  (add-to-list 'org-latex-packages-alist
               '("normalem" "ulem" t))
  (add-to-list 'org-latex-packages-alist
               '("" "amssymb" t))
  (add-to-list 'org-latex-packages-alist
               '("" "extarrows" t))
  (add-to-list 'org-latex-packages-alist
               '("" "capt-of" t))
  (add-to-list 'org-latex-packages-alist
               '("figuresright" "rotating" t))
  (add-to-list 'org-latex-packages-alist
               '("Lenny" "fncychap" t))

  (add-to-list 'org-latex-classes
               '("lengyue-org-book"
                 "\\documentclass{book}
  \\usepackage[slantfont, boldfont]{xeCJK}
  % chapter set
  \\usepackage{titlesec}
  \\usepackage{hyperref}
  \\hypersetup{colorlinks,linkcolor=black,filecolor=black,urlcolor=blue,citecolor=black}
  \\usepackage{fontspec}
  \\usepackage{xunicode}
  \\titleformat{\\paragraph}{\\normalfont\\normalsize\\bfseries}{\\theparagraph}{1em}{}
  [NO-DEFAULT-PACKAGES]
  [PACKAGES]


  \\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  \\setCJKsansfont{WenQuanYi Micro Hei}
  \\setCJKmonofont{WenQuanYi Micro Hei Mono}

  \\setmainfont{DejaVu Sans} % 英文衬线字体
  \\setsansfont{DejaVu Serif} % 英文无衬线字体
  \\setmonofont{DejaVu Sans Mono}
  %\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  %\\setsansfont{WenQuanYi Micro Hei}
  %\\setmonofont{WenQuanYi Micro Hei Mono}

  %如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。
  \\defaultfontfeatures{Mapping=tex-text}

  % 中文断行
  \\XeTeXlinebreaklocale \"zh\"
  \\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt

  % 代码设置
  \\lstset{numbers=left,
  numberstyle= \\tiny,
  keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},
  frame=shadowbox,
  breaklines=true,
  rulesepcolor= \\color{ red!20!green!20!blue!20}
  }

  [EXTRA]
  "
                   ("\\chapter{%s}" . "\\chapter*{%s}")
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (add-to-list 'org-latex-classes
               '("lengyue-org-article"
                 "\\documentclass{article}
  \\usepackage[slantfont, boldfont]{xeCJK}
  \\usepackage{titlesec}
  \\usepackage{hyperref}
  \\hypersetup{colorlinks,linkcolor=black,filecolor=black,urlcolor=blue,citecolor=black}
  \\usepackage{fontspec}
  \\usepackage{xunicode}
  \\titleformat{\\paragraph}{\\normalfont\\normalsize\\bfseries}{\\theparagraph}{1em}{}

  [NO-DEFAULT-PACKAGES]
  [PACKAGES]

  \\parindent 2em

  \\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  \\setCJKsansfont{WenQuanYi Micro Hei}
  \\setCJKmonofont{WenQuanYi Micro Hei Mono}

  \\setmainfont{DejaVu Sans} % 英文衬线字体
  \\setsansfont{DejaVu Serif} % 英文无衬线字体
  \\setmonofont{DejaVu Sans Mono}
  %\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  %\\setsansfont{WenQuanYi Micro Hei}
  %\\setmonofont{WenQuanYi Micro Hei Mono}

  %如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。
  \\defaultfontfeatures{Mapping=tex-text}

  % 中文断行
  \\XeTeXlinebreaklocale \"zh\"
  \\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt

  % 代码设置
  \\lstset{numbers=left,
  numberstyle= \\tiny,
  keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},
  frame=shadowbox,
  breaklines=true,
  rulesepcolor= \\color{ red!20!green!20!blue!20}
  }

  [EXTRA]
  "
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (add-to-list 'org-latex-classes
               '("lengyue-org-beamer"
                 "\\documentclass{beamer}
  \\usepackage[slantfont, boldfont]{xeCJK}
  % beamer set
  \\usepackage[none]{hyphenat}
  \\usepackage[abs]{overpic}
  \\usepackage{fontspec}
  \\usepackage{xunicode}


  [NO-DEFAULT-PACKAGES]
  [PACKAGES]

  \\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  \\setCJKsansfont{WenQuanYi Micro Hei}
  \\setCJKmonofont{WenQuanYi Micro Hei Mono}

  \\setmainfont{DejaVu Sans} % 英文衬线字体
  \\setsansfont{DejaVu Serif} % 英文无衬线字体
  \\setmonofont{DejaVu Sans Mono}
  %\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体
  %\\setsansfont{WenQuanYi Micro Hei}
  %\\setmonofont{WenQuanYi Micro Hei Mono}

  %如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。
  \\defaultfontfeatures{Mapping=tex-text}

  % 中文断行
  \\XeTeXlinebreaklocale \"zh\"
  \\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt

  % 代码设置
  \\lstset{numbers=left,
  numberstyle= \\tiny,
  keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},
  frame=shadowbox,
  breaklines=true,
  rulesepcolor= \\color{ red!20!green!20!blue!20}
  }

  [EXTRA]
  "
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (setq org-latex-pdf-process
          '("xelatex -interaction nonstopmode -output-directory %o %f"
            ;; "biber %b" "xelatex -interaction nonstopmode -output-directory %o %f"
            "bibtex %b"
            "xelatex -interaction nonstopmode -output-directory %o %f"
            "xelatex -interaction nonstopmode -output-directory %o %f"))

  ;; (defcustom org-preview-latex-process-alist
  ;;    (quote
  ;;     (
  ;;      (dvipng :programs
  ;;              ("latex" "dvipng")
  ;;              :description "dvi > png" :message "you need to install the programs: latex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust
  ;;              (1.0 . 1.0)
  ;;              :latex-compiler
  ;;              ("latex -interaction nonstopmode -output-directory %o %f")
  ;;              :image-converter
  ;;              ("dvipng -fg %F -bg %B -D %D -T tight -o %O %f"))
  ;;      (dvisvgm :programs
  ;;               ("latex" "dvisvgm")
  ;;               :description "xdv > svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust
  ;;               (1.0 . 1.0)
  ;;               :latex-compiler
  ;;               ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
  ;;               :image-converter
  ;;               ("dvisvgm %f   %O"))
  ;;      (imagemagick :programs
  ;;                   ("latex" "convert")
  ;;                   :description "pdf > png" :message "you need to install the programs: latex and imagemagick." :use-xcolor t :image-input-type "pdf" :image-output-type "png" :image-size-adjust
  ;;                   (1.0 . 1.0)
  ;;                   :latex-compiler
  ;;                   ("xelatex -interaction nonstopmode -output-directory %o %f")
  ;;                   :image-converter
  ;;                   ("convert -density %D -trim -antialias %f -quality 100 %O")))))

  ;; lualatex preview

  ;; (setq org-preview-latex-process-alist
  ;;       (plist-put (alist-get 'dvisvgm org-preview-latex-process-alist)
  ;;                  :description "xdv > svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust
  ;;                  ))

  ;; (setq org-preview-latex-process-alist
  ;;       (plist-put (alist-get 'dvisvgm org-preview-latex-process-alist)
  ;;                  :latex-compiler
  ;;                  ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")))

  ;; (push (cons 'dvisvgm
  ;;             (plist-put (alist-get dvisvgm org-preview-latex-process-alist)
  ;;                        :description "xdv > svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust
  ;;                        ))
  ;;       org-preview-latex-process-alist)

  ;; (push (cons 'dvisvgm
  ;;             (plist-put (alist-get dvisvgm org-preview-latex-process-alist)
  ;;                        :latex-compiler
  ;;                        ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")))
  ;;       org-preview-latex-process-alist)


  ;; (custom-set-variables
  ;;  ;; custom-set-variables was added by Custom.
  ;;  ;; If you edit it by hand, you could mess it up, so be careful.
  ;;  ;; Your init file should contain only one such instance.
  ;;  ;; If there is more than one, they won't work right.
  ;;  '(org-preview-latex-process-alist
  ;;    (quote
  ;;     ((dvipng :programs
  ;;              ("latex" "dvipng")
  ;;              :description "dvi > png" :message "you need to install the programs: latex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust
  ;;              (1.0 . 1.0)
  ;;              :latex-compiler
  ;;              ("latex -interaction nonstopmode -output-directory %o %f")
  ;;              :image-converter
  ;;              ("dvipng -fg %F -bg %B -D %D -T tight -o %O %f"))
  ;;      (dvisvgm :programs
  ;;               ("latex" "dvisvgm")
  ;;               :description "xdv > svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust
  ;;               (1.0 . 1.0)
  ;;               :latex-compiler
  ;;               ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
  ;;               :image-converter
  ;;               ("dvisvgm %f -n -b min -c %S -o %O"))
  ;;      (imagemagick :programs
  ;;                   ("latex" "convert")
  ;;                   :description "pdf > png" :message "you need to install the programs: latex and imagemagick." :use-xcolor t :image-input-type "pdf" :image-output-type "png" :image-size-adjust
  ;;                   (1.0 . 1.0)
  ;;                   :latex-compiler
  ;;                   ("xelatex -interaction nonstopmode -output-directory %o %f")
  ;;                   :image-converter
  ;;                   ("convert -density %D -trim -antialias %f -quality 100 %O")))))
  ;; )

  (setq org-format-latex-options (plist-put org-format-latex-options :html-scale 1.2))
#+END_SRC

在有数学公式的 org 文件中加入以下配置


#+BEGIN_SRC sh
  ,#+LATEX_CLASS: lengyue-org-book

  ,#+OPTIONS: tex:imagemagick

  ,#+LaTeX_HEADER: \usepackage[math-style=ISO]{unicode-math}
  ,#+LaTeX_HEADER: \setmathfont{xits-math.otf}
  ,#+LaTeX_HEADER: \usepackage[slantfont, boldfont]{xeCJK}
  ,#+LaTeX_HEADER: \usepackage{fontspec}
  ,#+LaTeX_HEADER: \setCJKmainfont{WenQuanYi Micro Hei}
  ,#+LaTeX_HEADER: \setmainfont{xits-math.otf}
  ,#+LaTeX_HEADER: \usepackage{extarrows}

  ,#+LaTeX_HEADER: \newtheorem{axiom}{\hskip 2em 公理}[section] %公理 axiom，独立编号
  ,#+LaTeX_HEADER: \newtheorem{de}{\hskip 2em 定义}[subsection] %定义 definition，简写为 de，独立编号
  ,#+LaTeX_HEADER: \newtheorem*{deus}{\hskip 2em 定义} %定义不编号 definition，简写为 deus
  ,#+LaTeX_HEADER: \newtheorem{thm}{\hskip 2em 定理}[subsection] %定理 theroem，简写为 thm，独立编号
  ,#+LaTeX_HEADER: \newtheorem*{thmus}{\hskip 2em 定理} %定理不编号 theroem，简写为 thmus
  ,#+LaTeX_HEADER: \newtheorem{lemma}[thm]{\hskip 2em 引理} %引理，记为 lemma，与 thm 共用编号
  ,#+LaTeX_HEADER: \newtheorem*{lemmaus}{\hskip 2em 引理} %引理不编号，记为 lemmaus
  ,#+LaTeX_HEADER: \newtheorem{cor}{\hskip 2em 推论}[thm] %推论 Corollary，简写为 col，在 thm 下面编号
  ,#+LaTeX_HEADER: \newtheorem{proposition}{\hskip 2em 性质}[subsection] %性质, 独立编号
  ,#+LaTeX_HEADER: \newtheorem{mingti}{\hskip 2em 命题}[subsection] %命题, 独立编号
  ,#+LaTeX_HEADER: \newtheorem{ex}{\emph{\hskip 2em 实例}}[thm] %example 獨立編號
  ,#+LaTeX_HEADER: \newtheorem*{exus}{\emph{\hskip 2em 实例}} %example 不编号
  ,#+LaTeX_HEADER: \newtheorem*{remark}{\bf{\hskip 2em 点评}} %点评不编号
  ,#+LaTeX_HEADER: \newtheorem{dde}{\hskip 2em 定义}  %定义
  ,#+LaTeX_HEADER: \newtheorem*{ddeus}{\hskip 2em 定义}
  ,#+LaTeX_HEADER: \renewcommand\qedsymbol{$\blacksquare$}
  ,#+LaTeX_HEADER: \renewcommand{\proofname}{\bf{\hskip 2em 证明}}
  ,#+LaTeX_HEADER: \newtheorem*{jd}{\emph{\hskip 2em 解答}}
  ,#+LaTeX_HEADER: \numberwithin{equation}{section}

#+END_SRC

再次编译博客主站的时候，会在 posts 目录下出现 ltxpng 文件夹，将次文件夹 copy 到 output 文件夹 posts 下即可。

用 imagemagick 编译的图片，比较小，尝试用 dvisvgm 进行编译，在 emacs 中可以成功，但是在博客目录下配置不起作用，待以后学习 lisp 之后再处理

