posts/bo-ke-qian-yi-za-ji-cong-hexodao-nikola.html

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">Latex preview</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
通过 Org-mode 的 latex preview 功能，在到处 html 时，将数学公式变成图片，可以通过以下配置
在 plugins org-mode 文件夹中建立 conf.el 文件，加入以下配置
</p>

<div class="highlight"><pre><span></span><span class="p">;;</span> Init file to use with the orgmode plugin.

<span class="p">;;</span> Load org-mode
<span class="p">;;</span> Requires org-mode v8.x


<span class="p">;;;</span> Custom configuration <span class="k">for</span> the export.

<span class="p">;;;</span> Add any custom configuration that you would like to <span class="s1">'conf.el'</span>.
<span class="o">(</span>setq nikola-use-pygments t
      org-export-with-toc t
      org-export-with-section-numbers nil
      org-startup-folded <span class="s1">'showeverything)</span>


<span class="s1">;;org-mode export to latex</span>
<span class="s1">(require '</span>ox-latex<span class="o">)</span>
<span class="o">(</span>setq org-export-latex-listings t<span class="o">)</span>

<span class="p">;;</span>org-mode <span class="nb">source</span> code setup in exporting to latex
<span class="o">(</span>add-to-list <span class="s1">'org-latex-listings</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"listings"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-listings</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"color"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"xcolor"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"listings"</span> t<span class="o">))</span>
<span class="p">;;</span><span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">;;             '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"fontspec"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"indentfirst"</span> t<span class="o">))</span>
<span class="p">;;</span><span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">;;             '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"xunicode"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"geometry"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"float"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"longtable"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"tikz"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"fancyhdr"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"textcomp"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"amsmath"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"amsthm"</span><span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"tabularx"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"booktabs"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"grffile"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"wrapfig"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"normalem"</span> <span class="s2">"ulem"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"amssymb"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"extarrows"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">""</span> <span class="s2">"capt-of"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"figuresright"</span> <span class="s2">"rotating"</span> t<span class="o">))</span>
<span class="o">(</span>add-to-list <span class="s1">'org-latex-packages-alist</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"Lenny"</span> <span class="s2">"fncychap"</span> t<span class="o">))</span>

<span class="o">(</span>add-to-list <span class="s1">'org-latex-classes</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"lengyue-org-book"</span>
	       <span class="s2">"\\documentclass{book}</span>
<span class="s2">\\usepackage[slantfont, boldfont]{xeCJK}</span>
<span class="s2">% chapter set</span>
<span class="s2">\\usepackage{titlesec}</span>
<span class="s2">\\usepackage{hyperref}</span>
<span class="s2">\\hypersetup{colorlinks,linkcolor=black,filecolor=black,urlcolor=blue,citecolor=black}</span>
<span class="s2">\\usepackage{fontspec}</span>
<span class="s2">\\usepackage{xunicode}</span>
<span class="s2">\\titleformat{\\paragraph}{\\normalfont\\normalsize\\bfseries}{\\theparagraph}{1em}{}</span>
<span class="s2">[NO-DEFAULT-PACKAGES]</span>
<span class="s2">[PACKAGES]</span>


<span class="s2">\\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">\\setCJKsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">\\setCJKmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">\\setmainfont{DejaVu Sans} % 英文衬线字体</span>
<span class="s2">\\setsansfont{DejaVu Serif} % 英文无衬线字体</span>
<span class="s2">\\setmonofont{DejaVu Sans Mono}</span>
<span class="s2">%\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">%\\setsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">%\\setmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">%如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。</span>
<span class="s2">\\defaultfontfeatures{Mapping=tex-text}</span>

<span class="s2">% 中文断行</span>
<span class="s2">\\XeTeXlinebreaklocale \"zh\"</span>
<span class="s2">\\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt</span>

<span class="s2">% 代码设置</span>
<span class="s2">\\lstset{numbers=left,</span>
<span class="s2">numberstyle= \\tiny,</span>
<span class="s2">keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},</span>
<span class="s2">frame=shadowbox,</span>
<span class="s2">breaklines=true,</span>
<span class="s2">rulesepcolor= \\color{ red!20!green!20!blue!20}</span>
<span class="s2">}</span>

<span class="s2">[EXTRA]</span>
<span class="s2">"</span>
		 <span class="o">(</span><span class="s2">"\\chapter{%s}"</span> . <span class="s2">"\\chapter*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\section{%s}"</span> . <span class="s2">"\\section*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsection{%s}"</span> . <span class="s2">"\\subsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsubsection{%s}"</span> . <span class="s2">"\\subsubsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\paragraph{%s}"</span> . <span class="s2">"\\paragraph*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subparagraph{%s}"</span> . <span class="s2">"\\subparagraph*{%s}"</span><span class="o">)))</span>

<span class="o">(</span>add-to-list <span class="s1">'org-latex-classes</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"lengyue-org-article"</span>
	       <span class="s2">"\\documentclass{article}</span>
<span class="s2">\\usepackage[slantfont, boldfont]{xeCJK}</span>
<span class="s2">\\usepackage{titlesec}</span>
<span class="s2">\\usepackage{hyperref}</span>
<span class="s2">\\hypersetup{colorlinks,linkcolor=black,filecolor=black,urlcolor=blue,citecolor=black}</span>
<span class="s2">\\usepackage{fontspec}</span>
<span class="s2">\\usepackage{xunicode}</span>
<span class="s2">\\titleformat{\\paragraph}{\\normalfont\\normalsize\\bfseries}{\\theparagraph}{1em}{}</span>

<span class="s2">[NO-DEFAULT-PACKAGES]</span>
<span class="s2">[PACKAGES]</span>

<span class="s2">\\parindent 2em</span>

<span class="s2">\\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">\\setCJKsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">\\setCJKmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">\\setmainfont{DejaVu Sans} % 英文衬线字体</span>
<span class="s2">\\setsansfont{DejaVu Serif} % 英文无衬线字体</span>
<span class="s2">\\setmonofont{DejaVu Sans Mono}</span>
<span class="s2">%\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">%\\setsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">%\\setmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">%如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。</span>
<span class="s2">\\defaultfontfeatures{Mapping=tex-text}</span>

<span class="s2">% 中文断行</span>
<span class="s2">\\XeTeXlinebreaklocale \"zh\"</span>
<span class="s2">\\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt</span>

<span class="s2">% 代码设置</span>
<span class="s2">\\lstset{numbers=left,</span>
<span class="s2">numberstyle= \\tiny,</span>
<span class="s2">keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},</span>
<span class="s2">frame=shadowbox,</span>
<span class="s2">breaklines=true,</span>
<span class="s2">rulesepcolor= \\color{ red!20!green!20!blue!20}</span>
<span class="s2">}</span>

<span class="s2">[EXTRA]</span>
<span class="s2">"</span>
		 <span class="o">(</span><span class="s2">"\\section{%s}"</span> . <span class="s2">"\\section*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsection{%s}"</span> . <span class="s2">"\\subsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsubsection{%s}"</span> . <span class="s2">"\\subsubsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\paragraph{%s}"</span> . <span class="s2">"\\paragraph*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subparagraph{%s}"</span> . <span class="s2">"\\subparagraph*{%s}"</span><span class="o">)))</span>

<span class="o">(</span>add-to-list <span class="s1">'org-latex-classes</span>
<span class="s1">	     '</span><span class="o">(</span><span class="s2">"lengyue-org-beamer"</span>
	       <span class="s2">"\\documentclass{beamer}</span>
<span class="s2">\\usepackage[slantfont, boldfont]{xeCJK}</span>
<span class="s2">% beamer set</span>
<span class="s2">\\usepackage[none]{hyphenat}</span>
<span class="s2">\\usepackage[abs]{overpic}</span>
<span class="s2">\\usepackage{fontspec}</span>
<span class="s2">\\usepackage{xunicode}</span>


<span class="s2">[NO-DEFAULT-PACKAGES]</span>
<span class="s2">[PACKAGES]</span>

<span class="s2">\\setCJKmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">\\setCJKsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">\\setCJKmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">\\setmainfont{DejaVu Sans} % 英文衬线字体</span>
<span class="s2">\\setsansfont{DejaVu Serif} % 英文无衬线字体</span>
<span class="s2">\\setmonofont{DejaVu Sans Mono}</span>
<span class="s2">%\\setmainfont{WenQuanYi Micro Hei} % 设置缺省中文字体</span>
<span class="s2">%\\setsansfont{WenQuanYi Micro Hei}</span>
<span class="s2">%\\setmonofont{WenQuanYi Micro Hei Mono}</span>

<span class="s2">%如果没有它，会有一些 tex 特殊字符无法正常使用，比如连字符。</span>
<span class="s2">\\defaultfontfeatures{Mapping=tex-text}</span>

<span class="s2">% 中文断行</span>
<span class="s2">\\XeTeXlinebreaklocale \"zh\"</span>
<span class="s2">\\XeTeXlinebreakskip = 0pt plus 1pt minus 0.1pt</span>

<span class="s2">% 代码设置</span>
<span class="s2">\\lstset{numbers=left,</span>
<span class="s2">numberstyle= \\tiny,</span>
<span class="s2">keywordstyle= \\color{ blue!70},commentstyle=\\color{red!50!green!50!blue!50},</span>
<span class="s2">frame=shadowbox,</span>
<span class="s2">breaklines=true,</span>
<span class="s2">rulesepcolor= \\color{ red!20!green!20!blue!20}</span>
<span class="s2">}</span>

<span class="s2">[EXTRA]</span>
<span class="s2">"</span>
		 <span class="o">(</span><span class="s2">"\\section{%s}"</span> . <span class="s2">"\\section*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsection{%s}"</span> . <span class="s2">"\\subsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subsubsection{%s}"</span> . <span class="s2">"\\subsubsection*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\paragraph{%s}"</span> . <span class="s2">"\\paragraph*{%s}"</span><span class="o">)</span>
		 <span class="o">(</span><span class="s2">"\\subparagraph{%s}"</span> . <span class="s2">"\\subparagraph*{%s}"</span><span class="o">)))</span>

<span class="o">(</span>setq org-latex-pdf-process
	<span class="s1">'("xelatex -interaction nonstopmode -output-directory %o %f"</span>
<span class="s1">	  ;; "biber %b" "xelatex -interaction nonstopmode -output-directory %o %f"</span>
<span class="s1">	  "bibtex %b"</span>
<span class="s1">	  "xelatex -interaction nonstopmode -output-directory %o %f"</span>
<span class="s1">	  "xelatex -interaction nonstopmode -output-directory %o %f"))</span>

<span class="s1">;; (defcustom org-preview-latex-process-alist</span>
<span class="s1">;;    (quote</span>
<span class="s1">;;     (</span>
<span class="s1">;;      (dvipng :programs</span>
<span class="s1">;;              ("latex" "dvipng")</span>
<span class="s1">;;              :description "dvi &gt; png" :message "you need to install the programs: latex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust</span>
<span class="s1">;;              (1.0 . 1.0)</span>
<span class="s1">;;              :latex-compiler</span>
<span class="s1">;;              ("latex -interaction nonstopmode -output-directory %o %f")</span>
<span class="s1">;;              :image-converter</span>
<span class="s1">;;              ("dvipng -fg %F -bg %B -D %D -T tight -o %O %f"))</span>
<span class="s1">;;      (dvisvgm :programs</span>
<span class="s1">;;               ("latex" "dvisvgm")</span>
<span class="s1">;;               :description "xdv &gt; svg" :message "you need to install the programs: latex and dvisvgm." :use-xcolor t :image-input-type "xdv" :image-output-type "svg" :image-size-adjust</span>
<span class="s1">;;               (1.0 . 1.0)</span>
<span class="s1">;;               :latex-compiler</span>
<span class="s1">;;               ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")</span>
<span class="s1">;;               :image-converter</span>
<span class="s1">;;               ("dvisvgm %f   %O"))</span>
<span class="s1">;;      (imagemagick :programs</span>
<span class="s1">;;                   ("latex" "convert")</span>
<span class="s1">;;                   :description "pdf &gt; png" :message "you need to install the programs: latex and imagemagick." :use-xcolor t :image-input-type "pdf" :image-output-type "png" :image-size-adjust</span>
<span class="s1">;;                   (1.0 . 1.0)</span>
<span class="s1">;;                   :latex-compiler</span>
<span class="s1">;;                   ("xelatex -interaction nonstopmode -output-directory %o %f")</span>
<span class="s1">;;                   :image-converter</span>
<span class="s1">;;                   ("convert -density %D -trim -antialias %f -quality 100 %O")))))</span>

<span class="s1">;; lualatex preview</span>

<span class="s1">;; (setq org-preview-latex-process-alist</span>
<span class="s1">;;       (plist-put (alist-get '</span>dvisvgm org-preview-latex-process-alist<span class="o">)</span>
<span class="p">;;</span>                  :description <span class="s2">"xdv &gt; svg"</span> :message <span class="s2">"you need to install the programs: latex and dvisvgm."</span> :use-xcolor t :image-input-type <span class="s2">"xdv"</span> :image-output-type <span class="s2">"svg"</span> :image-size-adjust
<span class="p">;;</span>                  <span class="o">))</span>

<span class="p">;;</span> <span class="o">(</span>setq org-preview-latex-process-alist
<span class="p">;;</span>       <span class="o">(</span>plist-put <span class="o">(</span>alist-get <span class="s1">'dvisvgm org-preview-latex-process-alist)</span>
<span class="s1">;;                  :latex-compiler</span>
<span class="s1">;;                  ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")))</span>

<span class="s1">;; (push (cons '</span>dvisvgm
<span class="p">;;</span>             <span class="o">(</span>plist-put <span class="o">(</span>alist-get dvisvgm org-preview-latex-process-alist<span class="o">)</span>
<span class="p">;;</span>                        :description <span class="s2">"xdv &gt; svg"</span> :message <span class="s2">"you need to install the programs: latex and dvisvgm."</span> :use-xcolor t :image-input-type <span class="s2">"xdv"</span> :image-output-type <span class="s2">"svg"</span> :image-size-adjust
<span class="p">;;</span>                        <span class="o">))</span>
<span class="p">;;</span>       org-preview-latex-process-alist<span class="o">)</span>

<span class="p">;;</span> <span class="o">(</span>push <span class="o">(</span>cons <span class="s1">'dvisvgm</span>
<span class="s1">;;             (plist-put (alist-get dvisvgm org-preview-latex-process-alist)</span>
<span class="s1">;;                        :latex-compiler</span>
<span class="s1">;;                        ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")))</span>
<span class="s1">;;       org-preview-latex-process-alist)</span>


<span class="s1">;; (custom-set-variables</span>
<span class="s1">;;  ;; custom-set-variables was added by Custom.</span>
<span class="s1">;;  ;; If you edit it by hand, you could mess it up, so be careful.</span>
<span class="s1">;;  ;; Your init file should contain only one such instance.</span>
<span class="s1">;;  ;; If there is more than one, they won'</span>t work right.
<span class="p">;;</span>  <span class="err">'</span><span class="o">(</span>org-preview-latex-process-alist
<span class="p">;;</span>    <span class="o">(</span>quote
<span class="p">;;</span>     <span class="o">((</span>dvipng :programs
<span class="p">;;</span>              <span class="o">(</span><span class="s2">"latex"</span> <span class="s2">"dvipng"</span><span class="o">)</span>
<span class="p">;;</span>              :description <span class="s2">"dvi &gt; png"</span> :message <span class="s2">"you need to install the programs: latex and dvipng."</span> :image-input-type <span class="s2">"dvi"</span> :image-output-type <span class="s2">"png"</span> :image-size-adjust
<span class="p">;;</span>              <span class="o">(</span><span class="m">1</span>.0 . <span class="m">1</span>.0<span class="o">)</span>
<span class="p">;;</span>              :latex-compiler
<span class="p">;;</span>              <span class="o">(</span><span class="s2">"latex -interaction nonstopmode -output-directory %o %f"</span><span class="o">)</span>
<span class="p">;;</span>              :image-converter
<span class="p">;;</span>              <span class="o">(</span><span class="s2">"dvipng -fg %F -bg %B -D %D -T tight -o %O %f"</span><span class="o">))</span>
<span class="p">;;</span>      <span class="o">(</span>dvisvgm :programs
<span class="p">;;</span>               <span class="o">(</span><span class="s2">"latex"</span> <span class="s2">"dvisvgm"</span><span class="o">)</span>
<span class="p">;;</span>               :description <span class="s2">"xdv &gt; svg"</span> :message <span class="s2">"you need to install the programs: latex and dvisvgm."</span> :use-xcolor t :image-input-type <span class="s2">"xdv"</span> :image-output-type <span class="s2">"svg"</span> :image-size-adjust
<span class="p">;;</span>               <span class="o">(</span><span class="m">1</span>.0 . <span class="m">1</span>.0<span class="o">)</span>
<span class="p">;;</span>               :latex-compiler
<span class="p">;;</span>               <span class="o">(</span><span class="s2">"xelatex -no-pdf -interaction nonstopmode -output-directory %o %f"</span><span class="o">)</span>
<span class="p">;;</span>               :image-converter
<span class="p">;;</span>               <span class="o">(</span><span class="s2">"dvisvgm %f -n -b min -c %S -o %O"</span><span class="o">))</span>
<span class="p">;;</span>      <span class="o">(</span>imagemagick :programs
<span class="p">;;</span>                   <span class="o">(</span><span class="s2">"latex"</span> <span class="s2">"convert"</span><span class="o">)</span>
<span class="p">;;</span>                   :description <span class="s2">"pdf &gt; png"</span> :message <span class="s2">"you need to install the programs: latex and imagemagick."</span> :use-xcolor t :image-input-type <span class="s2">"pdf"</span> :image-output-type <span class="s2">"png"</span> :image-size-adjust
<span class="p">;;</span>                   <span class="o">(</span><span class="m">1</span>.0 . <span class="m">1</span>.0<span class="o">)</span>
<span class="p">;;</span>                   :latex-compiler
<span class="p">;;</span>                   <span class="o">(</span><span class="s2">"xelatex -interaction nonstopmode -output-directory %o %f"</span><span class="o">)</span>
<span class="p">;;</span>                   :image-converter
<span class="p">;;</span>                   <span class="o">(</span><span class="s2">"convert -density %D -trim -antialias %f -quality 100 %O"</span><span class="o">)))))</span>
<span class="p">;;</span> <span class="o">)</span>

<span class="o">(</span>setq org-format-latex-options <span class="o">(</span>plist-put org-format-latex-options :html-scale <span class="m">1</span>.2<span class="o">))</span>
</pre></div>

<p>
在有数学公式的 org 文件中加入以下配置
</p>


<div class="highlight"><pre><span></span><span class="c1">#+LATEX_CLASS: lengyue-org-book</span>

<span class="c1">#+OPTIONS: tex:imagemagick</span>

<span class="c1">#+LaTeX_HEADER: \usepackage[math-style=ISO]{unicode-math}</span>
<span class="c1">#+LaTeX_HEADER: \setmathfont{xits-math.otf}</span>
<span class="c1">#+LaTeX_HEADER: \usepackage[slantfont, boldfont]{xeCJK}</span>
<span class="c1">#+LaTeX_HEADER: \usepackage{fontspec}</span>
<span class="c1">#+LaTeX_HEADER: \setCJKmainfont{WenQuanYi Micro Hei}</span>
<span class="c1">#+LaTeX_HEADER: \setmainfont{xits-math.otf}</span>
<span class="c1">#+LaTeX_HEADER: \usepackage{extarrows}</span>

<span class="c1">#+LaTeX_HEADER: \newtheorem{axiom}{\hskip 2em 公理}[section] %公理 axiom，独立编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{de}{\hskip 2em 定义}[subsection] %定义 definition，简写为 de，独立编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{deus}{\hskip 2em 定义} %定义不编号 definition，简写为 deus</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{thm}{\hskip 2em 定理}[subsection] %定理 theroem，简写为 thm，独立编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{thmus}{\hskip 2em 定理} %定理不编号 theroem，简写为 thmus</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{lemma}[thm]{\hskip 2em 引理} %引理，记为 lemma，与 thm 共用编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{lemmaus}{\hskip 2em 引理} %引理不编号，记为 lemmaus</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{cor}{\hskip 2em 推论}[thm] %推论 Corollary，简写为 col，在 thm 下面编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{proposition}{\hskip 2em 性质}[subsection] %性质, 独立编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{mingti}{\hskip 2em 命题}[subsection] %命题, 独立编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{ex}{\emph{\hskip 2em 实例}}[thm] %example 獨立編號</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{exus}{\emph{\hskip 2em 实例}} %example 不编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{remark}{\bf{\hskip 2em 点评}} %点评不编号</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem{dde}{\hskip 2em 定义}  %定义</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{ddeus}{\hskip 2em 定义}</span>
<span class="c1">#+LaTeX_HEADER: \renewcommand\qedsymbol{$\blacksquare$}</span>
<span class="c1">#+LaTeX_HEADER: \renewcommand{\proofname}{\bf{\hskip 2em 证明}}</span>
<span class="c1">#+LaTeX_HEADER: \newtheorem*{jd}{\emph{\hskip 2em 解答}}</span>
<span class="c1">#+LaTeX_HEADER: \numberwithin{equation}{section}</span>
</pre></div>

<p>
再次编译博客主站的时候，会在 posts 目录下出现 ltxpng 文件夹，将次文件夹 copy 到 output 文件夹 posts 下即可。
</p>

<p>
用 imagemagick 编译的图片，比较小，尝试用 dvisvgm 进行编译，在 emacs 中可以成功，但是在博客目录下配置不起作用，待以后学习 lisp 之后再处理
</p>
</div>
</div>
</div>
</div>
